
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password
  * module.sdp_db_user[0].null_resource.setup_sdp_user[&#34;pcq&#34;]
  * module.sdp_db_user[0].random_password.sdp_read_user_password
* Delete
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password
  * module.sdp_db_user.null_resource.setup_sdp_user[&#34;pcq&#34;]
  * module.sdp_db_user.random_password.sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      - id                      = "https://mi-vault-dev.vault.azure.net/secrets/pcq-backend-flexible-aat-read-user-name/65e2faba76eb4e9691dd4d1c3a2002d2" -> null
      - key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> null
      - name                    = "pcq-backend-flexible-aat-read-user-name" -> null
      - resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/pcq-backend-flexible-aat-read-user-name/versions/65e2faba76eb4e9691dd4d1c3a2002d2" -> null
      - resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/pcq-backend-flexible-aat-read-user-name" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "65e2faba76eb4e9691dd4d1c3a2002d2" -> null
      - versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/pcq-backend-flexible-aat-read-user-name" -> null
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      - id                      = "https://mi-vault-dev.vault.azure.net/secrets/pcq-backend-flexible-aat-read-user-password/712d24d0e57947b39640c4f65c7aa172" -> null
      - key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> null
      - name                    = "pcq-backend-flexible-aat-read-user-password" -> null
      - resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/pcq-backend-flexible-aat-read-user-password/versions/712d24d0e57947b39640c4f65c7aa172" -> null
      - resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/pcq-backend-flexible-aat-read-user-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "712d24d0e57947b39640c4f65c7aa172" -> null
      - versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/pcq-backend-flexible-aat-read-user-password" -> null
    }

  # module.sdp_db_user.null_resource.setup_sdp_user["pcq"] will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "null_resource" "setup_sdp_user" {
      - id       = "3623204377917991168" -> null
      - triggers = {
          - "database"        = "pcq"
          - "fqdn"            = "pcq-backend-flexible-aat.postgres.database.azure.com"
          - "name"            = "pcq-backend-flexible-aat"
          - "schemas"         = "public"
          - "script_hash"     = "09d8a0c139d2bd77f035b6069cda0083489604daea7bde6a65900fee85b1da84"
          - "sdp_reader_pass" = (sensitive value)
          - "sdp_reader_user" = "SDP_READ_USER"
        } -> null
    }

  # module.sdp_db_user.random_password.sdp_read_user_password will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "random_password" "sdp_read_user_password" {
      - bcrypt_hash      = (sensitive value) -> null
      - id               = "none" -> null
      - length           = 20 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "()-_" -> null
      - result           = (sensitive value) -> null
      - special          = true -> null
      - upper            = true -> null
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev"
      + name                    = "pcq-backend-flexible-aat-read-user-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev"
      + name                    = "pcq-backend-flexible-aat-read-user-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user[0].null_resource.setup_sdp_user["pcq"] will be created
  + resource "null_resource" "setup_sdp_user" {
      + id       = (known after apply)
      + triggers = {
          + "database"        = "pcq"
          + "fqdn"            = "pcq-backend-flexible-aat.postgres.database.azure.com"
          + "name"            = "pcq-backend-flexible-aat"
          + "schemas"         = "public"
          + "script_hash"     = "09d8a0c139d2bd77f035b6069cda0083489604daea7bde6a65900fee85b1da84"
          + "sdp_reader_pass" = (sensitive value)
          + "sdp_reader_user" = "SDP_READ_USER"
        }
    }

  # module.sdp_db_user[0].random_password.sdp_read_user_password will be created
  + resource "random_password" "sdp_read_user_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":852,"Program":"tfcmt","SHA1":"","Vars":{}} -->